[fortinet:fortigate]

# For all events, Extract date/time stamp from the date and time fields included in all FortiGate 
# log entries.
TIME_PREFIX = date=
TIME_FORMAT = %Y-%m-%d time=%H:%M:%S

# For all events, preserve the action field which is included in the raw machine data as a new
# field called fortinet-action.  Based on the specific model, the action field may be rewritten
# as configured beow in the model-specific portions of this file.
FIELDALIAS-action = action AS fortinet-action

# The action field is present in most FortiGate log entries, and is also used in many 
# of the CIM models.  This is an ugly eval statement, but not certain of a cleaner way to
# accomplish it.  Suggestions or pull requests welcome.
#
EVAL-action = case( \
    (logid=="0100032001" OR logid=="0100032002") AND status=="success", "success", \
    (logid=="0100032001" OR logid=="0100032002") AND status=="failed", "failure", \
    (logid=="0100032001" OR logid=="0100032002") AND 1==1, "unknown", \
    type=="event" AND subtype=="vpn" AND action=="tunnel-up", "success", \
    type=="event" AND subtype=="vpn" AND action=="*fail*", "failure", \
    type=="event" AND subtype=="vpn" AND 1==1, "failure", \
    type=="traffic" AND action=="accept", "allowed", \
    type=="traffic" AND action=="start", "allowed", \
    type=="traffic" AND action=="deny", "blocked", \
    type=="traffic" AND 1==1, "unknown", \
    type=="utm" AND subtype=="app-ctrl" AND action=="pass", "allowed", \
    type=="utm" AND subtype=="app-ctrl" AND action=="blocked", "blocked", \
    type=="utm" AND subtype=="webfilter" AND action=="passthrough", "allowed", \
    type=="utm" AND subtype=="webfilter" AND action=="allowed", "allowed", \
    type=="utm" AND subtype=="webfilter" AND action=="blocked", "blocked", \
    type=="utm" AND subtype=="virus" AND action=="blocked", "blocked", \
    type=="utm" AND subtype=="virus" AND action=="monitored", "allowed", \
    1=1, "unknown")

# Authentication Model
# References:
# http://docs.splunk.com/Documentation/CIM/4.1.0/User/Authentication
# http://docs.fortinet.com/d/fortios-log-message-reference
#

# Network Traffic Model
# References:
# http://docs.splunk.com/Documentation/CIM/4.1.0/User/NetworkTraffic
# http://docs.fortinet.com/d/fortios-log-message-reference

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  action           string          The action taken by the network device.       allowed, blocked, dropped, unknown
# See action eval statement above.


# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  app              string          The application protocol of the traffic.  
# This field exists in the raw data.

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  bytes            number          Total count of bytes handled by this 
#                                               device/interface (bytes_in + bytes_out).  
# All_Traffic  bytes_in  number   How many bytes this device/interface received.  
# All_Traffic  bytes_out  number   How many bytes this device/interface transmitted.  
FIELDALIAS-bytes_out = sentbyte AS bytes_out
FIELDALIAS-bytes_in = rcvdbyte AS bytes_in
EVAL-bytes = bytes_in + bytes_out

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  channel          number          The 802.11 channel used by a wireless network.  
# This field is included in some FortiGate wireless events.

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  dest             string          The destination of the network traffic 
#                                               (the remote host). May be aliased from more 
#                                               specific fields, such as dest_host, dest_ip, 
#                                               or dest_name.  
FIELDALIAS-dest = dstip AS dest

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  dest_bunit       string          These are derived fields provided by Asset and 
# All_Traffic  dest_category   string          Identity correlation features of certain 
#                                               advanced applications like the Splunk App for 
#                                               Enterprise Security. They should be left blank 
#                                               when writing add-ons

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  dest_interface   string          The interface that is listening remotely or 
#                                               receiving packets locally.  Can also be 
#                                               referred to as the "egress interface."  
FIELDALIAS-dest_interface = dstintf AS dest_interface

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  dest_ip          string          The IP address of the destination.  
FIELDALIAS-dest = dstip AS dest_ip

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  dest_mac         string          The destination TCP/IP layer 2 Media Access 
#                                               Control (MAC) address of a packet's 
#                                               destination, such as 06:10:9f:eb:8f:14. 
#                                               Note: Always force lower case on this field. 
#                                               Note: Always use colons instead of dashes, 
#                                               spaces, or no separator.  
# This field does not appear to be reliabaly included in the raw logs.

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  dest_port        number          The destination port of the network traffic.
FIELDALIAS-dest_port = dstport AS dest_port

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  dest_priority    string          The destination priority, if applicable.  
# This field does not appear to be reliably included in the raw logs.

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  dest_translated_ip  string       The NATed IPv4 or IPv6 address to which a 
#                                               packet has been sent.  
# The transip field in the raw data could be either a source or destination address based on 
# the transdisp field.  For now we ignore this and simply set the CIM field dest_translated_ip 
# to be the value of transip in all cases.
FIELDALIAS-dest_translated_ip = transip AS dest_translated_ip

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  dest_translated_port  number     The NATed port to which a packet has been sent.
# See comment for dest_translated_ip
FIELDALIAS-dest_translated_port = transport AS dest_translated_port

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  direction        string          The direction the packet is travelling.       inbound, outbound, unknown
# It's not immediately apparent how to extract this from the raw data.  Set to "unknown" in all cases.
EVAL-direction = "unknown"

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  duration         number          The amount of time for the completion of      
#                                               the network event, in seconds. 
# This is a new field in CIM version 4.1.0.  
# This field is included in the raw machine data.

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  dvc              string          The device that reported the traffic event. 
#                                               May be aliased from more specific fields, 
#      such as dvc_host, dvc_ip, or dvc_name.  
FIELDALIAS-dvc_name = devname AS dvc_name
FIELDALIAS-dvc = dvc_name AS dvc

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  dvc_bunit        string          These are derived fields provided by 
# All_Traffic  dvc_category     string          Asset and Identity correlation features 
# All_Traffic  dvc_ip           string          of certain advanced applications like the 
# All_Traffic  dvc_mac          string          Splunk App for Enterprise Security. They 
# All_Traffic  dvc_priority     string          should be left blank when writing add-ons.

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  flow_id          string          Unique identifier for this traffic stream, 
#                                               such as a netflow, jflow, or cflow.  
FIELDALIAS-flow_id = sessionid AS flow_id

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  icmp_code        string          The RFC 2780 or RFC 4443 human-readable code 
#                                               value of the traffic, such as Destination 
#                                               Unreachable or Parameter Problem . See the 
#                                               IMCP Type Numbers and the IMCPv6 Type Numbers.  
# Not immediately identified in the raw machine data.

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  icmp_type        number          The RFC 2780 or RFC 4443 numeric value of the 0 to 254
#                                               traffic. See the IMCP Type Numbers and the 
#                                               IMCPv6 Type Numbers.  
# Not immediately identified in the raw machine data.

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  packets_out  	number          The total count of packets transmitted by i
#                                               this device/interface.  
FIELDALIAS-packets_out = sentpkt AS packets_out

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  packets_in       number          The total count of packets received by this 
#                                               device/interface.  
FIELDALIAS-packets_in = rcvdpkt AS packets_in

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  packets          number          The total count of packets handled by this 
#                                               device/interface (packets_in + packets_out).  
EVAL-packets = packets_in + packets_out

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  protocol         string          The OSI layer 3 (network) protocol of the 
#                                               traffic observed, in lower case. For example, i
#                                               ip, appletalk, ipx.      
#
# For now: set this to "ip" in all cases.
EVAL-protocol = "ip"

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  protocol_version string          Version of the OSI layer 3 protocol. 
#
# For now: set this to "4" in all cases.  In future versions, intend to automatically detect v4 vs v6.
EVAL-protocol_version = "4"

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  response_time    number          The amount of time it took to receive a 
#                                               response in the network event, if applicable. 
# Not immediately identified in the raw machine data. 

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  rule             string          The rule which defines the action that was 
#                                               taken in the network event.
FIELDALIAS-rule = policyid as rule

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  session_id       string          The session identifier. Multiple transactions 
#                                               build a session.  
FIELDALIAS-session_id = sessionid as session_id
 
# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  src              string          The source of the network traffic (the client
#                                               requesting the connection). May be aliased 
#                                               from more specific fields, such as src_host, 
#                                               src_ip, or src_name. 
FIELDALIAS-src = srcip as src

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  src_category     string          The category of the network traffic source. 
# Not immediately identified in the raw machine data.

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  src_interface    string          The interface that is listening locally or 
#                                               sending packets remotely. Can also be referred 
#                                               to as the "ingress interface."  
FIELDALIAS-src_interface = srcintf as src_interface

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  src_ip           string          The ip address of the source.  
FIELDALIAS-src_ip = srcip as src_ip

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  src_mac          string          The source TCP/IP layer 2 Media Access 
#                                               Control (MAC) address of a packet's 
#                                               destination, such as 06:10:9f:eb:8f:14. 
FIELDALIAS-src_mac = srcmac as src_mac

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  src_port         number          The source port of the network traffic.
FIELDALIAS-src_port = srcport as src_port

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  src_priority     number          The priority of the source, if applicable.  
#
# Not immediately identifiable in raw machine data.

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  src_translated_ip  string        The NATed IPv4 or IPv6 address from which a 
#                                               packet has been sent..  
# The transip field in the raw data could be either a source or destination address based on 
# the transdisp field.  For now we ignore this and simply set the CIM field dest_translated_ip 
# to be the value of transip in all cases.
FIELDALIAS-src_translated_ip = transip as src_translated_ip

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  src_translated_port  number      The NATed port from which a packet has been 
#                                               sent.
# See comment above.
FIELDALIAS-src_translated_port = transport as src_translated_port

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  ssid             string          The 802.11 service set identifier (ssid) 
#                                               assigned to a wireless session.  
FIELDALIAS-ssid = srcssid as ssid

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  tag              string          The tag associated with the traffic.  
#
# Not immediately identifiable in raw machine data.

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  tcp_flag         string          The TCP flag(s) specified in the event.       Can be one or more of SYN, 
#                                                                                             ACK, FIN, RST, URG, or PSH.
#
# Not immediately identifiable in raw machine data.

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  transport        string          The OSI layer 4 (transport) protocol of the   tcp, udp, unknown
#                                               traffic observed, in lower case.  
LOOKUP-transport = transport-lookup proto OUTPUT transport

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  tos              string          The combination of source and destination IP 
#                                               ToS (type of service) values in the event.  
#
# Not immediately identifiable in raw machine data.

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  ttl              number          The "time to live" of a packet or diagram.  
#
# Not immediately identifiable in raw machine data.

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  user             string          The user that requested the traffic flow.  
#
# Field already exists in raw machine data, no modifications required.

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  user_bunit       string          These are derived fields provided by Asset 
#                                               and Identity correlation features of certain 
#                                               advanced applications like the Splunk App 
#                                               for Enterprise Security. They should be 
#                                               left blank when writing add-ons.

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  user_category    string          See description above.

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  user_priority    string          See description above.

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  vendor_product   string          The vendor technology of the device 
#                                               generating the network event, such as 
#                                               Juniper or Cisco. 
EVAL-vendor_product = "Fortinet" 

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  vlan             string          The virtual local area network (VLAN) 
#                                               specified in the record.  
#
# Not immediately identifiable in raw machine data.

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  wifi             string          The wireless standard(s) in use, such as 
#                                               802.11a, 802.11b, 802.11g, or 802.11n. 
#
# Not immediately identifiable in raw machine data.
