[fortinet:fortigate]

# References:
# http://docs.splunk.com/Documentation/CIM/4.0.0/User/NetworkTraffic
# http://docs.fortinet.com/d/fortios-log-message-reference

# Extract date/time stamp from the date and time fields included in all FortiGate 
# log entries.
TIME_PREFIX = date=
TIME_FORMAT = %Y-%m-%d time=%H:%M:%S

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  action           string          The action taken by the network device.       allowed, blocked, dropped, unknown
# The field action exists in the raw data but needs to be modified to match CIM requirements.  
# the original action field is stored as fortinet-action then a CIM compliant action is
# retrieved from the "action_lookup" table and stored in the action field.
FIELDALIAS-action = action AS fortinet-action
LOOKUP-action = action-lookup fortinet-action OUTPUT action

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  app              string          The application protocol of the traffic.  
# This field exists in the raw data.

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  bytes            number          Total count of bytes handled by this 
#                                               device/interface (bytes_in + bytes_out).  
# All_Traffic  bytes_in  number   How many bytes this device/interface received.  
# All_Traffic  bytes_out  number   How many bytes this device/interface transmitted.  
FIELDALIAS-bytes_out = sentbyte AS bytes_out
FIELDALIAS-bytes_in = rcvdbyte AS bytes_in
EVAL-bytes = bytes_in + bytes_out

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  channel          number          The 802.11 channel used by a wireless network.  
# This field is included in some FortiGate wireless events.

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  dest             string          The destination of the network traffic 
#                                               (the remote host). May be aliased from more 
#                                               specific fields, such as dest_host, dest_ip, 
#                                               or dest_name.  
FIELDALIAS-dest = dstip AS dest

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  dest_bunit       string          These are derived fields provided by Asset and 
# All_Traffic   dest_category   string          Identity correlation features of certain 
#                                               advanced applications like the Splunk App for 
#                                               Enterprise Security. They should be left blank 
#                                               when writing add-ons

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  dest_interface   string          The interface that is listening remotely or 
#                                               receiving packets locally.  Can also be 
#                                               referred to as the "egress interface."  
FIELDALIAS-dest_interface = dstintf AS dest_interface

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  dest_ip          string          The IP address of the destination.  
FIELDALIAS-dest = dstip AS dest_ip

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  dest_mac         string          The destination TCP/IP layer 2 Media Access 
#                                               Control (MAC) address of a packet's 
#                                               destination, such as 06:10:9f:eb:8f:14. 
#                                               Note: Always force lower case on this field. 
#                                               Note: Always use colons instead of dashes, 
#                                               spaces, or no separator.  
# This field does not appear to be reliabaly included in the raw logs.

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  dest_port        number          The destination port of the network traffic.
FIELDALIAS-dest_port = dstport AS dest_port

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  dest_priority    string          The destination priority, if applicable.  
# This field does not appear to be reliebaly included in the raw logs.

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  dest_translated_ip  string       The NATed IPv4 or IPv6 address to which a 
#                                               packet has been sent.  
# The transip field in the raw data could be iether a source or destination address based on 
# the transdisp field.  For now we ignore this and simply set the CIM field dest_translated_ip 
# to be the value of transip in all cases.
FIELDALIAS-dest_translated_ip = transip AS dest_translated_ip

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  dest_translated_port  number     The NATed port to which a packet has been sent.
# See comment for dest_translated_ip
FIELDALIAS-dest_translated_port = transport AS dest_translated_port

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  direction        string          The direction the packet is travelling.       inbound, outbound, unknown
# It's not immediately apparent how to extract this from the raw data.  Set to "unknown" in all cases.
EVAL-direction = "unknown"

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  dvc              string          The device that reported the traffic event. 
#                                               May be aliased from more specific fields, 
#      such as dvc_host, dvc_ip, or dvc_name.  
FIELDALIAS-dvc_name = devname AS dvc_name
FIELDALIAS-dvc = dvc_name AS dvc

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  dvc_bunit        string          These are derived fields provided by 
# All_Traffic  dvc_category     string          Asset and Identity correlation features 
# All_Traffic  dvc_ip           string          of certain advanced applications like the 
# All_Traffic  dvc_mac          string          Splunk App for Enterprise Security. They 
# All_Traffic  dvc_priority     string          should be left blank when writing add-ons.

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  flow_id          string          Unique identifier for this traffic stream, 
#                                               such as a netflow, jflow, or cflow.  
FIELDALIAS-flow_id = sessionid AS flow_id

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  icmp_code        string          The RFC 2780 or RFC 4443 human-readable code 
#                                               value of the traffic, such as Destination 
#                                               Unreachable or Parameter Problem . See the 
#                                               IMCP Type Numbers and the IMCPv6 Type Numbers.  

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  icmp_type        number          The RFC 2780 or RFC 4443 numeric value of the 0 to 254
#                                               traffic. See the IMCP Type Numbers and the 
#                                               IMCPv6 Type Numbers.  
# Not immediately identified in the raw machine data.

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  ip_version       number          The numbered Internet Protocol version.       4, 6
#                                               Splunk 5 or better autodetects IPv4 vs 
#												IPv6, rendering this field unnecessary.  
# Not immediately identified in the raw machine data.

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  packets_out  	number   		The total count of packets transmitted by i
#                                               this device/interface.  
FIELDALIAS-packets_out = sentpkt AS packets_out

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  packets_in       number          The total count of packets received by this 
#                                               device/interface.  
FIELDALIAS-packets_in = rcvdpkt AS packets_in

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  packets          number          The total count of packets handled by this 
#                                               device/interface (packets_in + packets_out).  
EVAL-packets = packets_in + packets_out

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  protocol         string          The OSI layer 3 (network) protocol of the     ipv4, ipv6, icmp, ipsec, igmp, rip, unknown
#                                               traffic observed, in lower case.  
#
# To do: evaluate source and destination ip addresses against regular expressions to determine if ipv4 or ipv6 is in use.
EVAL-protocol = "ipv4"

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  rule             string          The rule which defines the action that was 
#                                               taken in the network event.
FIELDALIAS-rule = policyid as rule

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  session_id       string          The session identifier. Multiple transactions 
#                                               build a session.  
FIELDALIAS-session_id = sessionid as session_id

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  src_interface    string          The interface that is listening locally or 
#                                               sending packets remotely. Can also be referred 
#                                               to as the "ingress interface."  
FIELDALIAS-src_interface = srcintf as src_interface

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  src_ip           string          The ip address of the source.  
FIELDALIAS-src_ip = srcip as src_ip

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  src_mac          string          The source TCP/IP layer 2 Media Access 
#                                               Control (MAC) address of a packet's 
#                                               destination, such as 06:10:9f:eb:8f:14. 
FIELDALIAS-src_mac = srcmac as src_mac

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  src_port         number          The source port of the network traffic.
FIELDALIAS-src_port = srcport as src_port

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  src_priority     number          The priority of the source, if applicable.  
#
# Not immediately identifiable in raw machine data.

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  src_translated_ip  string        The NATed IPv4 or IPv6 address from which a 
#                                               packet has been sent..  
FIELDALIAS-src_translated_ip = transip as src_translated_ip

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  src_translated_port  number      The NATed port from which a packet has been 
#                                               sent.
FIELDALIAS-src_translated_port = transport as src_translated_port

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  ssid             string          The 802.11 service set identifier (ssid) 
#                                               assigned to a wireless session.  
FIELDALIAS-ssid = srcssid as ssid

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  tag              string          The tag associated with the traffic.  
#
# Not immediately identifiable in raw machine data.

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  tcp_flag         string          The TCP flag(s) specified in the event.       Can be one or more of SYN, 
#                                                                                             ACK, FIN, RST, URG, or PSH.
#
# Not immediately identifiable in raw machine data.

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  transport        string          The OSI layer 4 (transport) protocol of the   tcp, udp, unknown
#                                               traffic observed, in lower case.  
LOOKUP-transport = transport-lookup proto OUTPUT transport

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  tos              string          The combination of source and destination IP 
#                                               ToS (type of service) values in the event.  
#
# Not immediately identifiable in raw machine data.

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  ttl              number          The "time to live" of a packet or diagram.  
#
# Not immediately identifiable in raw machine data.

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  user             string          The user that requested the traffic flow.  
#
# Field already exists in raw machine data, no modifications required.

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  user_bunit       string          These are derived fields provided by Asset 
#                                               and Identity correlation features of certain 
#                                               advanced applications like the Splunk App 
#                                               for Enterprise Security. They should be 
#                                               left blank when writing add-ons.

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  user_category    string          See description above.

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  user_priority    string          See description above.

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  vendor_product   string          The vendor technology of the device 
#                                               generating the network event, such as 
#                                               Juniper or Cisco. 
EVAL-vendor_product = "Fortinet" 

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  vlan             string          The virtual local area network (VLAN) 
#                                               specified in the record.  
#
# Not immediately identifiable in raw machine data.

# Object name  Field name       Data type       Description                                   Possible values
# All_Traffic  wifi             string          The wireless standard(s) in use, such as 
#                                               802.11a, 802.11b, 802.11g, or 802.11n. 
#
# Not immediately identifiable in raw machine data.
